In [1]:
import pandas as pd

In [1]:
a=10
b=20
c=a+b
print(c)

30

In [2]:
name=['Manish','Vishal','Rohit','Rohan','Manish','Ronit']
salery=[1000,2000,3000,4000,5000,6000]
city=['rnc','Hyd','MH','BLr','Karnatka','Masori']
df1=pd.DataFrame(zip(name,salery,city),columns=['Name','Sallery','City'])
df1

     Name  Sallery      City
0  Manish     1000       rnc
1  Vishal     2000       Hyd
2   Rohit     3000        MH
3   Rohan     4000       BLr
4  Manish     5000  Karnatka
5   Ronit     6000    Masori

In [3]:
df1.to_csv('Data2.csv')

In [4]:
df1.to_excel('Data2.xlsx')

In [5]:
pd.read_csv('Data2.csv') 
                           #to avoid another extra columns we need to apply index=False inside the small bracket

   Unnamed: 0    Name  Sallery      City
0           0  Manish     1000       rnc
1           1  Vishal     2000       Hyd
2           2   Rohit     3000        MH
3           3   Rohan     4000       BLr
4           4  Manish     5000  Karnatka
5           5   Ronit     6000    Masori

In [6]:
df1.to_csv('Data2.cvs',index=False)
df1

     Name  Sallery      City
0  Manish     1000       rnc
1  Vishal     2000       Hyd
2   Rohit     3000        MH
3   Rohan     4000       BLr
4  Manish     5000  Karnatka
5   Ronit     6000    Masori

In [7]:
df1[['Name','City']]

     Name      City
0  Manish       rnc
1  Vishal       Hyd
2   Rohit        MH
3   Rohan       BLr
4  Manish  Karnatka
5   Ronit    Masori

In [8]:
df1.drop(2)

     Name  Sallery      City
0  Manish     1000       rnc
1  Vishal     2000       Hyd
3   Rohan     4000       BLr
4  Manish     5000  Karnatka
5   Ronit     6000    Masori

In [9]:
df1

     Name  Sallery      City
0  Manish     1000       rnc
1  Vishal     2000       Hyd
2   Rohit     3000        MH
3   Rohan     4000       BLr
4  Manish     5000  Karnatka
5   Ronit     6000    Masori

In [10]:
import numpy as np
list1=[1,2,3,4,5]
list2=[2,5,6,7,5]
np.array(list1)+np.array(list2)
    # using numpy adding 2 list together

array([ 3,  7,  9, 11, 10])

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as snc

In [12]:
path=r'C:\Users\manish\Datafile\Visadataset.csv'
file_visa=pd.read_csv(path)
file_visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [13]:
file_visa.head(10)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.1400,Year,Y,Certified
6,EZYV07,Asia,Bachelor's,N,N,4985,1994,South,53635.3900,Year,Y,Certified
7,EZYV08,North America,Bachelor's,Y,N,3035,1924,West,418.2298,Hour,Y,Denied
8,EZYV09,Asia,Bachelor's,N,N,4810,2012,Midwest,74362.1900,Year,Y,Certified
9,EZYV10,Europe,Doctorate,Y,N,2251,1995,South,67514.7600,Year,Y,Certified

In [14]:
file_visa.tail(10)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25470,EZYV25471,North America,Master's,Y,N,2272,1970,Northeast,516.4101,Hour,Y,Certified
25471,EZYV25472,Asia,High School,N,N,40224,1962,Island,75587.4200,Year,Y,Certified
25472,EZYV25473,Asia,High School,N,N,1346,2003,Midwest,76155.6000,Year,N,Certified
25473,EZYV25474,Asia,Bachelor's,Y,N,2421,2007,Northeast,22845.5600,Year,Y,Certified
25474,EZYV25475,Africa,Doctorate,N,N,2594,1979,Northeast,51104.7800,Year,Y,Certified
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [15]:
file_visa.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [16]:
file_visa.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [17]:
file_visa.info

<bound method DataFrame.info of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>

In [18]:
len(file_visa)

25480

In [19]:
file_visa.shape

(25480, 12)

In [20]:
file_visa.size

305760

In [21]:
file_visa.iloc

In [22]:
print(file_visa.shape[0])   #.shape is used to knw about thier columns and row if we  gave [0]==row will shoow

25480

In [23]:
print(file_visa.shape[1]) #.shape is used to knw about thier columns and row if we  gave [1]==columns will shoow

12

In [24]:
i = 0

def change(i):
    i = i + 1
    return i

change(1)
print(i)

0

In [25]:
def change(i=1, j=2):
    i = i + j
    j = j + 1
    print(i, j)
change(j = 1, i = 2)

3 2

In [26]:
def outer():
    x = 10
    def inner():
        print(x)
    inner()
outer()

10

In [53]:
i=1
while True:
    if i%3==0:
        break
    print(i)
    i+=1

1
2

In [57]:
counter = 1
summ = 0
while counter <= 6:
    summ = summ + counter
    counter = counter + 2
print(summ)

9

In [59]:
i = 0
while i < 3:
 print(i)
 i += 1

0
1
2

In [67]:
i = 5
while i > 0:
    i -= 1
    print(i)

4
3
2
1
0

In [69]:
i = 2
while i <= 2:
 print(i)
 i += 1

2

In [109]:
round(2.500000000005)

3

In [95]:
import math
print(math.ceil(4.0000000000000005))

5

In [113]:
round(4.564,2)

4.56

In [129]:
for i in range(-2,-20,-2):
    print(i,end="-")

-2--4--6--8--10--12--14--16--18-

In [133]:
count=0
for i in range(1,8):
    count=count+i
print(count)

28